class DataSource {
  static List doaa = [
    {
      "title": "دعاء الرزق",
      "body":
          " اللّهم إن ذنوبي لم يبق لها إلا رجاء عفوك، وقد قدمت آلة الحرمان بين يدي ، فأنا أسألك ما لا أستحقّه، وأدعوك ما لا أستوجبه، وأتضرّع إليك بما لا أستأهله ولم يخفَ عليك حالي وإن خفي على النّاس كُنه معرفة أمري، اللّهم إن كان رزقي في السّماء فأهبطه، وإن كان في الأرض فأظهره، وإن كان بعيداً فقرّبه، وإن كان قريباً فيسّره وإن كان قليلاً فكثّره وبارك لنا فيه . اللّهم ربّ السّموات السّبع ورب الأرض ورب العرش العظيم، ربنا وربّ كلّ شيءٍ فالق الحَبّ والنّوى ومنزّل التّوراة والإنجيل والفرقان، أعوذ بك من شرّ كلّ شيء أنت آخذ بناصيته، اللهمّ أنت الأول فليس قبلك شيء، وأنت الآخر فليس بعدك شيء، وأنت الظّاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء، اقض عنا الدَّين واغننا من الفقر. اللّهم مالك الملك تؤتي الملك من تشاء وتنزع المُلك ممن تشاء وتعزّ من تشاء وتذلّ من تشاء، بيدك الخير إنّك على كل شيء قدير، تولج اللّيل في النّهار وتولج النّهار في اللّيل، وتخرج الحيّ من الميّت، وتخرج الميّت من الحيّ، وترزق من تشاء بغير حساب، رحمن الدنيا والآخرة ورحيمهما تعطي من تشاء منهما وتمنع من تشاء ارحمني رحمة تُغنني بها عن رحمة من سواك."
    },
    {
      "title": "دعاء الدين",
      "body":
          "اللَّهمَّ اكفِني بحلالِك عن حرامِك واغنِني بفضلِك عمَّن سواك). (اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ العَجْزِ والكَسَلِ، والجُبْنِ والبُخْلِ والهَرَمِ، وأَعُوذُ بكَ مِن عَذابِ القَبْرِ، وأَعُوذُ بكَ مِن فِتْنَةِ المَحْيا والمَماتِ"
    },
    {
      "title": "دعاء الفرج والتيسير",
      "body":
          "اللهم فوضت امري كله، فجمّله خيرا بما شئت، واجعلني يا رب ممن نظرت إليه فرحمته، وسمعت دعاءه فأجبته"
    },
    {
      "title": "دعاء الهم والضيق",
      "body":
          "اللهم اجبر كسر قلبي، جبراً يتعجب منه أهل السماوات والأرض، جبرا يليق بكرمك، وعظمتك، وقدرتك، يا رب."
    },
    {
      "title": "دعاء فك الكرب",
      "body":
          "لا إله إلا الله العظيم الحليم، لا إله إلا الله ربّ السّموات والأرض، وربّ العرش العظيم وكان النبي دائم الذكر لهذا الحديث ” اللهم إنّي أعوذ بك من الهمّ والحزن، والعجز والكسل، والبخل والجبن، وضلع الدّين، وغلبة الرّجال” وقال رسول الله أنه عندما يتعرض الإنسان لكرب فيدعو بهذا الدعاء “اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله لا إله إلا أنت”"
    },
    {
      "title": "دعاء السفر",
      "body":
          "الله أكبر الله أكبر الله أكبر، 〈سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ ⓭ وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ ⓮ 〉  ” اللّهمّ إنّا نسألُكَ في سَفَرِنَا هذَا البِرّ والتّقْوَى، ومِن العَمَلِ مَاتَرْضَى، اللّهمّ هَوِّنْ عَلَيْنَا سَفَرِنَا هذَا وَاطْوِ عَنَّا بُعْدَه، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعَثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَر وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ “. وَإِذَا رَجَعَ قَالَهُنَّ وَزَادَ ” آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ “ رَوَاهُ مُسْلِمْ."
    },
    {
      "title": "دعاء الشفاء للمريض",
      "body":
          "اللهمّ إنّي أسألك من عظيم لطفك وكرمك وسترك الجميل أن تشفيه وتمدّه بالصحّة والعافية. اللهم إنا نسألك بأسمائك الحسنى وبصفاتك العلا وبرحمتك التي وسعت كلّ شيء، أن تمنّ علينا بالشفاء العاجل، وألّا تدع فينا جرحًا إلّا داويته، ولا ألمًا إلا سكنته، ولا مرضًا إلا شفيته، وألبسنا ثوب الصحة والعافية عاجلًا غير آجلًا، وشافِنا وعافِنا واعف عنا، واشملنا بعطفك ومغفرتك، وتولّنا برحمتك يا أرحم الراحمين."
    },
    {
      "title": "الدعاء للميت",
      "body":
          "(اللَّهُمَّ، اغْفِرْ له وَارْحَمْهُ، وَاعْفُ عنْه وَعَافِهِ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بمَاءٍ وَثَلْجٍ وَبَرَدٍ، وَنَقِّهِ مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِن دَارِهِ، وَأَهْلًا خَيْرًا مِن أَهْلِهِ، وَزَوْجًا خَيْرًا مِن زَوْجِهِ، وَقِهِ فِتْنَةَ القَبْرِ وَعَذَابَ النَّارِ)"
    },
    {
      "title": "دعاء وداع رمضان",
      "body":
          "اللهم إنا استودعناك رمضان فلا تجعله آخر عهدنا، وأعده علينا أعوامًا عديدة ولا تخرجنا منه إلا مقبولين ومرحومين ومعتوقين من النار. اللهم لا تخرجنا من رمضان إلا وانت راضً عنا يارب اللهم إجعل رمضان هذا شاهدًا لنا لا علينا أَللّهُمَّ في عَيد الفطر هذَا يَوْمٌ مُبَارَكٌ، وَالمُسْلِمُونَ فِيهِ مُجْتَمِعُونَ فِي أَقْطَارِ أَرْضِكَ، يَشْهَدُ السَّائِلُ مِنْهُمْ وَالطَّالِبُ وَالرَّاغِبُ، وَالرَّاهِبُ وَأَنْتَ النَّاظِرُ فِي حَوَائِجِهِمْ، فَأَسْأَ لُكَ بِجُودِكَ وَكَرَمِكَ وَهَوَانِ مَا سَأَلْتُكَ عَلَيْكَ، أَنْ تُصَلِّيَ عَلَى مُحَمَّد وَآلِهِ، وَأَسْأَ لُكَ اللّهُمَّ رَبَّنَا بِأَنَّ لَكَ المُلْكَ وَالحَمْدَ لاَ إِلهَ إِلاَّ أَنْتَ الحَلِيمُ الكَرِيمُ، الحَنَّانُ المَنَّانُ، ذُو الجَلاَلِ وَالاِكْرَامِ، بَدِيعُ السَّماوَاتِ وَالاَرْضِ، مَهْمَا قَسَمْتَ بَيْنَ عِبَادِكَ المُؤْمِنينَ مِنْ خَيْر أَوْ بَرَكَة أَوْ هُدىً أَوْ عَمَل بِطَاعَتِكَ أَوْ خَيْر تَمُنُّ بِهِ عَلَيْهِمْ تَهْدِيهِمْ بِهِ إِلَيْكَ أَوْ تَرْفَعُ لَهُمْ عِنْدَكَ دَرَجَةً أَوْ تُعْطِيهِمْ بِهِ خَيْرًا مِنْ خَيْرِ الدُّنْيَا وَالاخِرَةِ، أَنْ تُوَفِّرَ حَظِّي وَنَصِيبِي مِنْهُ."
    },
    {
      "title": "دعاء استقبال رمضان",
      "body":
          "اللهم ارزقني صيامه وقيامه وتلاوة القرآن فيه اللهم سلمه لنا وتسلمه منا وسلمنا فيه وقد عفوت عنا وغفرت لنا ورحمتنا . اللهم اجعل صيامي فيه صيام الصائمين وقيامي فيه قيام القائمين ونبهني فيه على نومة الغافلين وهب لي فيه اليسر والعافية إنك على كل شي قدير وقربني فيه إلى مرضاتك وجنبني فيه من سخطك ونقماتك ووفقني فيه لقراءة آياتك برحمتك ياارحم الراحمين "
    },
    {
      "title": "دعاء الإفطار الصحيح",
      "body":
          "-اللهم إني اسألك برحمتك التي وسعت كل شيء أن تغفر لي. – اللهم لك صمت، وعلى رزقك أفطرت."
    },
    {
      "title": "دعاء الاستفتاح",
      "body":
          "اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس،، اللهم اغسلني من خطاياي بالثلج والماء والبرد."
    },
  ];

  static List khwater = [
    {"body": "يا مَن يشتري دار الفردوس يعمرها بركعة في ظلام الليل يخفيها "},
    {
      "body":
          "اثنان لا تنسهما .. ذكر الله والموت، واثنان لا تذكرهما .. إحسانك للناس وإساءتهم إليك."
    },
    {
      "body":
          "لتكن خطاك في دروب الخير على رمل ندِيٍ لا يُسمع لها وقع لكن آثارها بيّنة "
    },
    {"body": "ليس مَن مات واستراح بميت .. إنما الميت ميت الأحياء."},
    {
      "body":
          "العمرُ تُنقِصه الساعات، والصحة تَعرِضُ لها الآفات، والعبدُ لا يستقبل يومًا إلا بفراقِ آخر، وأعظمُ المصائبِ انقطاعُ الرّجاء"
    },
    {"body": "إن المعصية تورث ضيق النفس .. والمعصية تجر الأخرى فراجع نفسك"},
    {
      "body":
          "إلهي إن سهيت يوماً ولم أقل حمداً، وإن نسيت يوماً ولم أقل شكراً، و إن حملت ذنوباً لا تطاق فاغفر لي واعفُ وإصفح عني يارحمن يارحيم."
    },
    {
      "body":
          "إذا أردت الانتفاع بالقرآن فاجمع قلبك عند تلاوته وسماعه، وألقِ سمعك، وأحضر حضور من يخاطبه به من تكلّم به سبحانه منه إليه، فإنه خطاب منه لك على لسان رسوله."
    },
    {"body": "مَن لزم الاستغفار جعل الله له من كل هم فرجاً ومن كل ضيق مخرجاً."},
    {
      "body":
          "اللّهم أخرج حب الدنيا من قلوبنا، وأبدلنا حُباً لجنتك وشوقاً لرؤيتك."
    },
    {
      "body":
          "رَبي امنحنِي قلباً مُبتسِماً مغموراً بِالصبر، لا يضعف أمام شيء سواك."
    },
    {"body": "قف تذكّر حاسب نفسك .. لا يراك الله حيث نهاك ولا يفقدك حيث أمرك."},
    {"body": "من وجد الله فماذا فقد؟ ومن فقد الله فماذا وجد؟"},
    {
      "body":
          "قد مَضى العمر وفات يا أسير الغفلات فاغنم العمر و بادر بالتقى قبل الممات"
    },
    {
      "body":
          "فتسري في عروقه سريان الماء الزلال بعد فورة عطش شديد، فيثلج صدرة ويروى ضموده ليعود للقلب نقاءه وللنفس"
    },
    {
      "body":
          "إنّ دُور الجنة تبنى بالذكر فإذا أمسك الذاكر عن الذكر أمسكت الملائكة عن البناء. "
    },
    {"body": "إن طاف بك طائف من همٍ فالجأ إلى الله وامنح غيرك "},
    {"body": "مهما تساقطت من عصارة روحك غصّه.. لا تبالي فكلٍ يأخذ منها حصّه"},
    {"body": "مهما قسى قلبك بعد اللين.. أرخي سمعك للحق وتذلل لرب العالمين"},
    {
      "body":
          "لو كانت الدنيا كلّها هم وهي ليست كذلك، لكان حري بمن يرجو الجنة ألّا يحزن"
    },
    {
      "body":
          "لا تندم على إحسان صادق بذلته فالطيور لا تأخذ مقابلاً على تغريدها. إ"
    },
  ];

  static List azkarsbah = [
    {
      'body1':
          'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.  [آية الكرسى - البقرة 255].',
      'body2':
          'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
      'num': 1,
    },
    {
      'body1':
          'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
      'body2':
          'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ',
      'num': 3,
    },
    {
      'body1':
          'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبر',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.',
      'body2':
          'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.',
      'num': 3,
    },
    {
      'body1':
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
      'body2':
          'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح',
      'num': 1,
    },
    {
      'body1':
          'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
      'body2': 'من قالها أعتقه الله من النار. ',
      'num': 4,
    },
    {
      'body1':
          'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
      'body2': 'من قالها حين يصبح أدى شكر يومه.',
      'num': 1,
    },
    {
      'body1':
          'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ',
      'body2': 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
      'num': 7,
    },
    {
      'body1':
          'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. ',
      'body2': 'من قالها لم يضره من الله شيء',
      'num': 3,
    },
    {
      'body1':
          'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. ',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1': 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ',
      'body2': 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
      'num': 10,
    },
    {
      'body1':
          'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. ',
      'body2': '',
      'num': 3,
    },
    {
      'body1':
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. ',
      'body2': '',
      'num': 1,
    },
    {
      'body1':
          'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.',
      'body2': 'ذكر طيب. ',
      'num': 1,
    },
    {
      'body1':
          'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ',
      'body2':
          'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. ',
      'num': 100,
    },
    {
      'body1': 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ',
      'body2':
          'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
      'num': 100,
    },
    {
      'body1': 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ ',
      'body2':
          'مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.',
      'num': 100,
    },
  ];

  static List azlarmasaa = [
    {
      "body1":
          "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].",
      "body2":
          "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
      "num": 1,
    },
    {
      "body1":
          "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].",
      "body2": "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
      "num": 1,
    },
    {
      "body1":
          "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
      "body2":
          "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
      "num": 3,
    },
    {
      "body1":
          "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
      "body2":
          "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      "num": 1,
    },
    {
      "body1":
          "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
      "body2":
          "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
      "num": 3,
    },
    {
      "body1":
          "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      "body2": "من قالها أعتقه الله من النار.",
      "num": 4,
    },
    {
      "body1":
          "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      "body2": "من قالها حين يمسى أدى شكر يومه.",
      "num": 1,
    },
    {
      "body1":
          "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ",
      "body2": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
      "num": 7,
    },
    {
      "body1":
          "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      "body2": "من قالها لم يضره من الله شيء",
      "num": 3,
    },
    {
      "body1":
          "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم",
      "body2": "",
      "num": 1,
    },
    {
      "body1":
          "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ",
      "body2": "",
      "num": 3,
    },
    {
      "body1": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ",
      "body2": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة",
      "num": 10,
    },
    {
      "body1":
          "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ",
      "body2": "",
      "num": 3,
    },
    {
      "body1":
          "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ",
      "body2":
          "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. ",
      "num": 100,
    },
    {
      "body1":
          "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
      "body2": "ذكر طيب. ",
      "num": 1,
    },
    {
      "body1": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ",
      "body2":
          "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
      "num": 100,
    },
  ];
}
